tutorials/incompressible/simpleFoam/drivaerFastback/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

#include    "$FOAM_CASE/0/U"

patches     ( ".*(body|Wheels)" );

magUInf     $Uinlet;
lRef        $wheelBase;
Aref        2.154;

liftDir     (0 0 1);
dragDir     (1 0 0);

CofR        (1.391 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

// ************************************************************************* //
