tutorials/incompressible/simpleFoam/drivaerFastback/system/slices
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields  (p U);

surfaces
(
    xNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            point    (4 0 1);
            normal   $x;
        }
        filtering    full;
    }

    yNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            point    (-5 0.02 1);
            normal   $y;
        }
        filtering    full;
    }
);

// ************************************************************************* //
